benchmarks/faaasc-artillery/suites copy/bank/512/artillery.local.yaml
config:
  target: http://app-lb-1035490685.eu-west-2.elb.amazonaws.com
  phases:
    - duration: 5
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 10
      arrivalRate: 5
      name: Maximum AWS Lambda instance load
    - duration: 5
      arrivalRate: 5
      rampTo: 1
      name: Decrease load
  plugins:
    expect: {}
    apdex: {}
    metrics-by-endpoint:
      useOnlyRequestNames: true
    fake-data: {}
  processor: "./payload.mjs"
scenarios:
  - flow:
      - post:
          url: "/"
          qs:
            task_id: "bank-512-local"
          beforeRequest: "preparePayload"
          json: "{{ payload }}"